In [1]:
#Pyhon DataFrames

#A DataFrames is a two-dimentional labeled data structure that is used for data manipulation and analysis.
#it can store data of different types .
#every column holds values pf a single data type and you can have multple columns with 
# multiple data types.
#each row is labelled with a unique index value and each column has a unnique label.

# you can perform operations like .filetring sorting ,merging and transforming data.
 
# size of your data frame can change ,meaning you can modify rows,add rows,or delete rows and columns
# you can perfrom arithmetic operations on rows and columns .

In [5]:
df= pd.DataFrame()

In [4]:
import pandas as pd
import numpy as np

In [6]:
df

Empty DataFrame
Columns: []
Index: []

In [7]:
df.shape

(0, 0)

In [8]:
df=pd.DataFrame([1,2,3,4])

In [9]:
df.shape

(4, 1)

In [10]:
df

   0
0  1
1  2
2  3
3  4

In [12]:
nested_list=[["alex",10],["bob",45],["clarke",78]]

In [26]:
df.index=["first","second","third"]

In [24]:
df=pd.DataFrame(nested_list)
df

        0   1
0    alex  10
1     bob  45
2  clarke  78

In [29]:
df.columns=["Name","Highest_Score"]
df

          Name  Highest_Score
first     alex             10
second     bob             45
third   clarke             78

In [30]:
df1 = pd.DataFrame([['Mumbai',2,0.5], ['Delhi',3,0.3,0.3], ['Bangalore',2], ['Kolkata', 1], ["chennai",2]])

In [32]:
df1.shape

(5, 4)

In [33]:
df1

           0  1    2    3
0     Mumbai  2  0.5  NaN
1      Delhi  3  0.3  0.3
2  Bangalore  2  NaN  NaN
3    Kolkata  1  NaN  NaN
4    chennai  2  NaN  NaN

In [37]:
#from a dictionary of np arrays/lsits
dict_list={
    "name":["tom","jack","steve","ricky"],
    "age":[45,23,45,12]
}
df=pd.DataFrame(dict_list)
df

    name  age
0    tom   45
1   jack   23
2  steve   45
3  ricky   12

In [40]:
# Creating DataFrame form a list of dictionary
sample_dict=[{"a":1,"b":2},{"a":5,"b":6,"c":4},{"a":4,"x":3,"b":2}]
df=pd.DataFrame(sample_dict)
df

   a  b    c    x
0  1  2  NaN  NaN
1  5  6  4.0  NaN
2  4  2  NaN  3.0

In [42]:
import numpy as np
import pandas as pd
#Creating a DataFrame from a dictionary of Series objects
d = {'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([1,2,3,4],index=list('abcd'))}
df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [45]:
df=pd.DataFrame(pd.Series([1,2,3,4],index=list('abcd')))
df

   0
a  1
b  2
c  3
d  4

In [61]:
dict={"name":["A","B","C","D"],
"Age":[10,20,30,40],
"Gender":["M","F","M","F"],
"rating":[4.5,4,3.5,3]}
df=pd.DataFrame(dict,index=["r1","r2","r3","r4"])

df

   name  Age Gender  rating
r1    A   10      M     4.5
r2    B   20      F     4.0
r3    C   30      M     3.5
r4    D   40      F     3.0

In [55]:
table={"Name":pd.Series(["A","B","C","D"]),"Age":pd.Series([10,20,30,40]),"Gender":pd.Series(["M","F","M","F"]),"Rating":pd.Series([4.5,4,3.5,3])}
Data=pd.DataFrame((table))
Data.index=["r1","r2","r3","r4"]
Data

   Name  Age Gender  Rating
r1    A   10      M     4.5
r2    B   20      F     4.0
r3    C   30      M     3.5
r4    D   40      F     3.0

In [62]:
Data.index=["row1","row2","row3","row4"]

In [63]:
Data

     Name  Age Gender  Rating
row1    A   10      M     4.5
row2    B   20      F     4.0
row3    C   30      M     3.5
row4    D   40      F     3.0

In [65]:
Data.columns=["c1","c2","c3","c4"]
Data

     c1  c2 c3   c4
row1  A  10  M  4.5
row2  B  20  F  4.0
row3  C  30  M  3.5
row4  D  40  F  3.0

In [66]:
df=Data

In [67]:
df["c3"]

row1    M
row2    F
row3    M
row4    F
Name: c3, dtype: object

In [69]:
print(type(df["c3"]))

<class 'pandas.core.series.Series'>

In [71]:
df.loc["row2"]

c1      B
c2     20
c3      F
c4    4.0
Name: row2, dtype: object

In [72]:
#.iloc is for slicing your Dataframe based on posiiton(integer based indexing)
#.loc is used for slicing your DataFRame based on labels (index labels or column labels)
df

     c1  c2 c3   c4
row1  A  10  M  4.5
row2  B  20  F  4.0
row3  C  30  M  3.5
row4  D  40  F  3.0

In [73]:
df.iloc[:]

     c1  c2 c3   c4
row1  A  10  M  4.5
row2  B  20  F  4.0
row3  C  30  M  3.5
row4  D  40  F  3.0

In [74]:
df["c3"]

row1    M
row2    F
row3    M
row4    F
Name: c3, dtype: object

In [76]:
df.loc[:,"c3"]

row1    M
row2    F
row3    M
row4    F
Name: c3, dtype: object

In [77]:
df[["c1","c2"]]

     c1  c2
row1  A  10
row2  B  20
row3  C  30
row4  D  40

In [81]:
df.loc[:,["c1","c2"]]

     c1  c2
row1  A  10
row2  B  20
row3  C  30
row4  D  40

In [82]:
#specific rows for specific columns
df.loc[["row1","row2"],["c1","c3"]]

     c1 c3
row1  A  M
row2  B  F

In [83]:
df.loc["row1":"row3"]

     c1  c2 c3   c4
row1  A  10  M  4.5
row2  B  20  F  4.0
row3  C  30  M  3.5

In [85]:
df[df["c4"]>3.5]

     c1  c2 c3   c4
row1  A  10  M  4.5
row2  B  20  F  4.0

In [91]:
condition = (df["c4"]>=3.5) & (df["c2"]>=30)
df.loc[condition]

     c1  c2 c3   c4
row3  C  30  M  3.5

In [92]:
df.loc[df["c2"]>=35,["c1","c4"]]

     c1   c4
row4  D  3.0

In [ ]:
df.loc[df["c3"]=="F" , ["row1","row2","row4"]]

In [99]:
#filter an dupdate multiple columns
condition=df["c1"].str.startswith("S")
df.loc[condition,["c2","c4"]]=[35,2.25]

In [100]:
df

     c1  c2 c3   c4
row1  A  10  M  4.5
row2  B  20  F  4.0
row3  C  30  M  3.5
row4  D  40  F  3.0

In [ ]:
#list out name

In [ ]:
# Renaming columns and rows of your dataFRame
df.

In [102]:
df["sport"]=["cricket","football","tennis","cricket"]

In [103]:
df

     c1  c2 c3   c4     sport
row1  A  10  M  4.5   cricket
row2  B  20  F  4.0  football
row3  C  30  M  3.5    tennis
row4  D  40  F  3.0   cricket

In [104]:
df.insert(4,"city",["bangalore","kochi","pune","chennai"])

In [105]:
df

     c1  c2 c3   c4       city     sport
row1  A  10  M  4.5  bangalore   cricket
row2  B  20  F  4.0      kochi  football
row3  C  30  M  3.5       pune    tennis
row4  D  40  F  3.0    chennai   cricket

In [108]:
df=df.drop(columns="city")

In [109]:
df.insert(2,"city",["bangalore","kochi","pune","chennai"])

In [110]:
df

     c1  c2       city c3   c4     sport
row1  A  10  bangalore  M  4.5   cricket
row2  B  20      kochi  F  4.0  football
row3  C  30       pune  M  3.5    tennis
row4  D  40    chennai  F  3.0   cricket

In [111]:
df["c4"]=[1,2,3,4]

In [112]:
df

     c1  c2       city c3  c4     sport
row1  A  10  bangalore  M   1   cricket
row2  B  20      kochi  F   2  football
row3  C  30       pune  M   3    tennis
row4  D  40    chennai  F   4   cricket

In [115]:
df.replace({"sport":"cricket","city":"chennai"},"Nil",inplace=True)

In [116]:
df

     c1  c2       city c3  c4     sport
row1  A  10  bangalore  M   1       Nil
row2  B  20      kochi  F   2  football
row3  C  30       pune  M   3    tennis
row4  D  40        Nil  F   4       Nil

In [121]:
df.replace({"c3":"F","city":"chennai"},"Random",inplace=False)

     c1  c2       city      c3  c4     sport
row1  A  10  bangalore       M   1       Nil
row2  B  20      kochi  Random   2  football
row3  C  30       pune       M   3    tennis
row4  D  40        Nil  Random   4       Nil

In [122]:
df

     c1  c2       city      c3  c4     sport
row1  A  10  bangalore       M   1       Nil
row2  B  20      kochi  Random   2  football
row3  C  30       pune       M   3    tennis
row4  D  40        Nil  Random   4       Nil